Semester-7/Технология разработки прикладных решений 1С/lab9/src/Catalogs/Склады.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<Catalog>
		<Properties>
			<Name>Склады</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>АдресСклада</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Инвентаризация</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Semester-7/Технология разработки прикладных решений 1С/lab9/src/CommonForms/ФормаПервогоЗапуска/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	Приветствие = "Добро пожаловать в конфигурацию «Простой склад»! Это окно "
		+ "показывается один раз — при первом запуске программы.";

	// Задание 8, пункт 2: показываем склады, у которых инвентаризация сегодня.
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	Склады.Наименование КАК Наименование,
		|	Склады.АдресСклада КАК АдресСклада
		|ИЗ
		|	Справочник.Склады КАК Склады
		|ГДЕ
		|	НАЧАЛОПЕРИОДА(Склады.Инвентаризация, ДЕНЬ) = &Сегодня";
	Запрос.УстановитьПараметр("Сегодня", НачалоДня(ТекущаяДатаСеанса()));

	Выборка = Запрос.Выполнить().Выбрать();
	Строки = Новый Массив;
	Пока Выборка.Следующий() Цикл
		Строки.Добавить(Выборка.Наименование + " (" + Выборка.АдресСклада + ")");
	КонецЦикла;

	Если Строки.Количество() = 0 Тогда
		СкладыСИнвентаризацией = "На сегодня инвентаризация не запланирована ни на одном складе.";
	Иначе
		СкладыСИнвентаризацией = "Сегодня инвентаризация на складах: "
			+ СтрСоединить(Строки, ", ") + ".";
	КонецЕсли;

	// Признак первого запуска выставляем сами — кнопка «Больше не показывать» не нужна.
	УстановитьПризнакПервогоЗапуска();

КонецПроцедуры

&НаСервереБезКонтекста
Процедура УстановитьПризнакПервогоЗапуска()

	Константы.ПервыйЗапускОсуществлен.Установить(Истина);

КонецПроцедуры
